In [3]:
import pandas as pd
import numpy as np

### a) Creating Dataframes

creating dataframe using list

In [5]:
l = [[1 , 2] , [3 , 4] , [5 , 6]]
pd.DataFrame(l)

   0  1
0  1  2
1  3  4
2  5  6

Creating DataFrame from dct of ndarray lst

In [9]:
d =  {'Name' : ['Pikachu' , 'Raichu' , 'Charmander'] , 'Type' : ['Mouse' , 'Mouse' , 'Lizard']}
pd.DataFrame(d)

         Name    Type
0     Pikachu   Mouse
1      Raichu   Mouse
2  Charmander  Lizard

In [15]:
df = pd.DataFrame(d)
df[['Name' , 'Type']]

         Name    Type
0     Pikachu   Mouse
1      Raichu   Mouse
2  Charmander  Lizard

### b) Slicing in DataFrame using loc and iloc

In [45]:
data = {'One' : list(range(1 , 5 )) , 
        'Two' : list(range(10 , 41 , 10)) , 
        'Three' : list(range(100 , 401 , 100)) ,
        'Four' : list(range(1000 , 4001 , 1000))}
df = pd.DataFrame(data)
print(df)

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [51]:
df['Two']

0    10
1    20
2    30
3    40
Name: Two, dtype: int64

In [21]:
df.loc[1]

One         2
Two        20
Three     200
Four     2000
Name: 1, dtype: int64

In [22]:
df.loc[1 : 2]

   One  Two  Three  Four
1    2   20    200  2000
2    3   30    300  3000

In [27]:
df.loc[: , :]

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [26]:
df.loc[::2 , 'One' : 'Three']

   One  Two  Three
0    1   10    100
2    3   30    300

In [28]:
df.iloc[:3:2 , 1:3:2]

   Two
0   10
2   30

Selecting specific rows

In [30]:
df.iloc[[0 , 2] , [1 , 3]]

   Two  Four
0   10  1000
2   30  3000

### c) Slicing using conditions

works with loc

In [32]:
df[df['Two']>20]

   One  Two  Three  Four
2    3   30    300  3000
3    4   40    400  4000

In [35]:
df.loc[df['Two']>20 , ['Three' , 'Four']]

   Three  Four
2    300  3000
3    400  4000

### d) Column Addition in Dataframe

In [36]:
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

a column can be add in three ways 
- using list
- using PAndas Series
- modification in existinh column and add

In [46]:
l = [22 , 33 , 44 , 55]
df['Five'] = l
df

   One  Two  Three  Four  Five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [47]:
l = [111 , 222 , 333 , 444]
df['Six'] = pd.Series(l)
df

   One  Two  Three  Four  Five  Six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

In [48]:
df['Seven'] = df['Two'] + df['Three']
df

   One  Two  Three  Four  Five  Six  Seven
0    1   10    100  1000    22  111    110
1    2   20    200  2000    33  222    220
2    3   30    300  3000    44  333    330
3    4   40    400  4000    55  444    440

### e) Column Deletion in DataFrame

In [49]:
del df['Six']
df

   One  Two  Three  Four  Five  Seven
0    1   10    100  1000    22    110
1    2   20    200  2000    33    220
2    3   30    300  3000    44    330
3    4   40    400  4000    55    440

In [52]:
df.pop('Five')
df

   One  Two  Three  Four  Seven
0    1   10    100  1000    110
1    2   20    200  2000    220
2    3   30    300  3000    330
3    4   40    400  4000    440

### f) Addition of rows

In [55]:
d1 = pd.DataFrame([[1 , 2] , [3 , 4]] , columns = ['a' , 'b'])
d2 = pd.DataFrame([[5 , 6 ] , [7, 8]] , columns = ['a' , 'b'])
df = pd.concat([d1 , d2]).reset_index(drop = True)
df

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

### g) Pandas Drop Function

In [61]:
data = {'One' : list(range(1 , 5 )) , 
        'Two' : list(range(10 , 41 , 10)) , 
        'Three' : list(range(100 , 401 , 100)) ,
        'Four' : list(range(1000 , 4001 , 1000))}
df = pd.DataFrame(data)
print(df)

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

- axis = 0 row wise
- axis = 1 column wise

In [62]:
df.drop([1 , 3] , axis = 0 , inplace = True)
df

   One  Two  Three  Four
0    1   10    100  1000
2    3   30    300  3000

In [63]:
df.drop(['One' , 'Four'] , axis = 1 , inplace = True)
df

   Two  Three
0   10    100
2   30    300

### h) Transposeing a DataFrame